test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       1920;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       1940;
    }
    leftUpWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       1960;
    }
    rightUpWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       1980;
    }
    anode
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       2000;
    }
    cathode
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       2040;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2000;
        startFace       2080;
    }
)

// ************************************************************************* //
