test/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Uair;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (2.7 0 0);
    }

    outlet
    {
    	type		zeroGradient;
    }

    leftUpWall
    {
        type            noSlip;
    }

    rightUpWall
    {
        type            noSlip;
    }

    anode
    {
        type            noSlip;
    }
    
    cathode
    {
        type            noSlip;
    }        

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
