test/0/phiE
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      phiE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    leftUpWall
    {
        type            zeroGradient;
    }

    rightUpWall
    {
        type            zeroGradient;
    }

    anode
    {
        type            fixedValue;
        value           uniform 800;
    }
    
    cathode
    {
        type            fixedValue;
        value           uniform 0;
    }    

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
