test/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    UFinal
    {
        $U;
        tolerance       1e-06;
        relTol          0;
    }

    
    phiE
    {
        solver           PCG;
        preconditioner   DIC;
        smoother         symGaussSeidel;
        tolerance        1e-6;
        relTol           0.2;
    }

    phiEFinal
    {
        solver           PCG;
        preconditioner   DIC;
        smoother         symGaussSeidel;
        tolerance        1e-6;
        relTol           0.2;
    }
    
    rho
    {
    	solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.2;
    }
    rhoFinal
    {
    	solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.2;
    }
    
/*
    #codeStream
    {
    	code
    	#{
        	int maxQ = qmax.value();
        	for (label i=0; i<=maxQ; i++)
        	{
            		Nq[i]
            		{
    				solver          PBiCGStab;
        			preconditioner  DILU;
        			tolerance       1e-6;
        			relTol          0.1;
    	    		}
        	}
        	writeEntry(os, "", Nq[i]);
    	#};
    };
*/
 
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    equations
    {
        "U.*"           1;
        "k.*"           1;
        "epsilon.*"     1;
        "s.*"           1;
    }
}



// ************************************************************************* //
